-- Table structure for table `device_model`
--

DROP TABLE IF EXISTS `device_model`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `device_model` (
  `dev_mod_id` int unsigned NOT NULL AUTO_INCREMENT,
  `dev_cat_id` int NOT NULL,
  `dev_cat_name` varchar(100) DEFAULT NULL,
  `dev_mod_name` varchar(100) NOT NULL,
  `dev_mod_desc` varchar(255) DEFAULT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `created_by` varchar(45) DEFAULT NULL,
  `updated_by` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`dev_mod_id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `device_model`
--

LOCK TABLES `device_model` WRITE;
/*!40000 ALTER TABLE `device_model` DISABLE KEYS */;
INSERT INTO `device_model` VALUES (4,3,'大气数据激励设备','DQJ-001','DQJ-0011',0,'2019-11-29 16:05:30','2023-08-17 15:34:18',NULL,'qn001'),(5,5,'外部测量设备','WBCL-001','WBCL-001',0,'2020-06-04 11:02:52','2020-06-05 19:46:37','admin','admin'),(6,6,'转台','PF001','PF001',0,'2020-06-06 15:38:12','2020-06-06 15:59:02','admin','gy001'),(7,2,'工业相机','MV-CA050-20GC','5M相机',0,'2020-06-09 16:42:44','2020-10-12 11:39:18','zh001','admin'),(8,7,'xx','yy','yy123',0,'2020-08-12 14:29:58','2020-08-12 14:29:58','system','system'),(10,9,'无线电高度激励设备','001','001',0,'2020-09-27 15:13:43','2020-09-27 15:13:43','admin','admin'),(11,10,'FTI','001','001',0,'2020-10-21 14:15:14','2020-10-21 14:15:14','admin','admin'),(12,12,'ATE','001','001',0,'2021-05-31 17:02:57','2021-05-31 17:02:57','admin','admin'),(13,13,'GSL','001','001',0,'2021-05-31 17:03:08','2021-05-31 17:03:08','admin','admin'),(14,14,'CKT','CKT001','线缆测试设备',0,'2021-12-01 17:31:24','2021-12-01 17:31:24','qn','qn'),(15,15,'机器人','KUKA','机器人',0,'2021-12-01 17:36:10','2021-12-01 17:36:10','qn','qn'),(16,16,'电动缸','EC','电动缸',0,'2021-12-01 17:56:15','2021-12-01 17:56:15','qn','qn'),(17,18,'顶控板DI1','顶控板DI1','DI1继电器',0,'2022-03-13 09:43:53','2022-03-13 09:43:53','qn','qn'),(18,39,'顶控板DI1','顶控板DI2','DI2继电器',0,'2022-03-13 09:44:18','2023-02-28 18:17:48','qn','28404121'),(19,19,'顶控板DO1','DO1','顶控板DO1继电器',0,'2022-03-13 09:44:37','2022-03-13 09:44:37','qn','qn'),(20,20,'顶控板DO2','DO2','顶控板DO2继电器',0,'2022-03-13 09:44:52','2022-03-13 09:44:52','qn','qn'),(21,21,'供电模拟器','供电模拟器','供电模拟器简图页2和3',0,'2022-03-13 09:49:30','2022-10-20 20:08:10','qn','28404121'),(22,23,'静止变频器','jzbpq','静止变频器',0,'2022-03-13 09:49:50','2022-03-13 09:49:50','qn','qn'),(23,24,'供电模拟器1','gdmnq1','供电模拟器1',0,'2022-03-13 09:50:08','2022-03-13 09:50:08','qn','qn'),(24,25,'无线电','wxd','无线电设备',0,'2022-06-13 18:14:13','2022-06-13 18:14:13','qn','qn'),(25,26,'蓄电池加温','xdcjw','蓄电池加温设备',0,'2022-06-13 18:14:29','2022-06-13 18:14:29','qn','qn'),(26,27,'环控压调模拟器','hkyt','环控压调模拟器设备',0,'2022-06-13 18:14:48','2022-06-13 18:14:48','qn','qn'),(27,28,'麦克风','麦克风','语音识别设备',0,'2022-06-13 18:46:08','2022-06-13 18:46:08','qn','qn'),(30,31,'机电综合激励设备','机电综合激励设备','机电综合激励设备',0,'2022-10-26 14:16:01','2022-10-26 14:16:01','28404121','28404121'),(31,32,'飞参设备','001','飞参设备',0,'2022-12-26 17:35:14','2022-12-26 17:35:14','qn001','qn001'),(32,33,'LDU','001','LDU',0,'2022-12-26 17:37:24','2022-12-26 17:37:24','qn001','qn001'),(33,34,'电压采集设备','001','电压采集设备',0,'2022-12-26 17:40:13','2022-12-26 17:40:13','qn001','qn001'),(34,35,'轮毂状态切换设备','001','轮毂状态切换设备',0,'2022-12-26 17:42:48','2022-12-26 17:42:48','qn001','qn001'),(35,36,'任务舱门','001','任务舱门',0,'2022-12-26 17:44:16','2022-12-26 17:44:16','qn001','qn001'),(36,37,'视频抽引','001','视频抽引',0,'2022-12-27 10:01:41','2022-12-27 10:01:41','qn001','qn001'),(37,18,'顶控板DI1','顶控板DI2','DI2继电器',0,'2023-02-28 18:32:48','2023-02-28 18:32:57','28404121','28404121'),(38,40,'扭力杆圈数测量装置','1','扭力杆圈数测量装置',0,'2023-03-08 11:11:46','2023-03-08 11:11:46','29300624','29300624'),(39,41,'倾角传感器','001','倾角传感器',0,'2023-03-09 17:51:59','2023-03-09 17:51:59','admin','admin'),(40,42,'MBIT设备','001','MBIT设备',0,'2023-06-03 10:29:43','2023-06-03 10:29:43','28404121','28404121'),(43,2,'工业相机','11','11',0,'2023-08-17 15:46:27','2023-08-17 15:46:27','qn001','qn001'),(46,43,'左侧舵面测量','001','001',0,NULL,NULL,NULL,NULL),(47,50,'飞参计算机','001','飞参计算机',0,NULL,NULL,NULL,NULL),(48,44,'右侧舵面测量','001','右侧舵面测量-001',0,NULL,NULL,NULL,NULL),(49,45,'升降舵方向舵测量','001','001',0,NULL,NULL,NULL,NULL),(50,51,'分布式测温','001','分布式测温-001',0,NULL,NULL,NULL,NULL),(51,52,'液压综合管理','001','液压综合管理-001',0,NULL,NULL,NULL,NULL),(52,53,'前轮转弯f','001','前轮转弯-001',0,NULL,NULL,NULL,NULL),(53,54,'ntp时间获取','001','ntp时间获取-',0,NULL,NULL,NULL,NULL),(54,9,'无线电高度激励设备','002','新高度表激励设备（试用）',0,NULL,NULL,NULL,NULL),(56,56,'无线电高度激励设备002','RDARC-900','新无线电高度激励设备',0,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `device_model` ENABLE KEYS */;
UNLOCK TABLES;

--
