-- Table structure for table `device_category`
--

DROP TABLE IF EXISTS `device_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `device_category` (
  `dev_cat_id` int unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `dev_cat_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '设备种类名',
  `dev_cat_desc` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '设备种类描述',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '状态：0-启用；1-删除',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `created_by` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '创建操作用户的id',
  `updated_by` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '更新操作用户的id',
  `subject_id` int DEFAULT NULL COMMENT '所属专业id',
  `dev_cat_code` varchar(255) DEFAULT NULL COMMENT '维护设备编码',
  `dev_cat_alias` varchar(255) DEFAULT NULL COMMENT '设备别名',
  `is_support_device` tinyint DEFAULT '0' COMMENT '是否维护设备',
  PRIMARY KEY (`dev_cat_id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8mb3 COMMENT='设备分类表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `device_category`
--

LOCK TABLES `device_category` WRITE;
/*!40000 ALTER TABLE `device_category` DISABLE KEYS */;
INSERT INTO `device_category` VALUES (2,'工业相机','工业相机',0,NULL,'2020-10-12 11:39:08',NULL,'admin',NULL,'camera','工业相机',0),(3,'大气数据激励设备','大气数据激励设备',0,NULL,'2020-12-04 16:38:18',NULL,'admin',-1,'dqsjjl','大气数据激励设备',0),(5,'外部测量设备','测量舵面角度',0,'2022-12-26 00:00:03','2020-06-05 19:46:28','admin','zh001',1,'wbcl','测量舵面角度',0),(6,'转台','单轴速率转台',0,'2023-02-11 09:45:43','2020-06-06 15:59:27','zh001','gy001',-1,'zt','单轴速率转台',0),(9,'无线电高度激励设备','无线电高度激励设备',0,'2022-12-26 00:00:00','2020-12-04 16:38:27','admin','admin',3,'gdb','无线电高度激励设备',0),(10,'主飞控地面维护设备','主飞控地面维护设备',0,'2022-12-26 00:00:00','2020-12-04 16:38:36','admin','admin',1,'fti','主飞控地面维护设备',0),(11,'模拟驾驶舱','模拟驾驶舱',0,'2021-04-08 14:57:21','2021-04-08 14:57:21','admin','admin',-1,'mnjsc','模拟驾驶舱',0),(12,'自动飞行','自动飞行地面维护设备',0,'2022-12-26 00:00:02','2021-05-21 10:28:23','qn001','qn001',1,'ate','自动飞行地面维护设备',0),(13,'高升力地面维护设备','高升力地面维护设备',0,'2022-12-26 00:00:01','2021-05-21 10:29:01','qn001','qn001',1,'gsl','高升力地面维护设备',0),(14,'CKT','线缆测试设备',0,'2021-11-24 16:50:49','2021-11-24 16:50:49','qn001','qn001',-1,'ckt','线缆测试设备',0),(15,'机器人','机器人',0,'2021-12-01 17:34:56','2021-12-01 17:34:56','qn','qn',-1,'jqr','机器人',0),(16,'电动缸','推脚蹬',0,'2021-12-01 17:55:22','2021-12-01 17:55:22','qn','qn',-1,'ddg','推脚蹬',0),(18,'顶控板DI1','DI1继电器',0,'2022-12-26 00:00:01','2023-02-28 18:16:20','qn001','28404121',2,'dkb','顶控板开关',0),(19,'顶控板DO1','顶控板DO1',0,'2022-12-26 00:00:02','2022-03-13 09:43:04','qn001','qn',-1,'dkb1','顶控板DO1',0),(20,'顶控板DO2','顶控板DO2',0,'2022-12-26 00:00:03','2022-03-13 09:43:09','qn001','qn',-1,'dkb2','顶控板DO2',0),(21,'供电模拟器B','供电模拟器2与3简图页',0,'2022-12-26 00:00:04','2022-10-20 20:07:38','qn001','28404121',2,'gdmnqb','供电模拟器B',0),(23,'静止变频器','静止变频器',0,'2022-12-26 00:00:06','2022-02-24 14:42:01','qn001','qn001',2,'jzbpq','静止变频器',0),(24,'供电模拟器1','供电模拟器1',0,'2022-12-26 00:00:05','2022-02-25 09:30:34','qn001','qn001',2,'gdmnq1','供电模拟器1',0),(25,'无线电','无线电',0,'2023-02-11 18:11:50','2022-06-13 18:11:50','qn','qn',3,'wxd','无线电',0),(26,'蓄电池加温','蓄电池加温',0,'2022-12-26 00:00:07','2022-06-13 18:12:00','qn','qn',2,'xdcjw','蓄电池加温',0),(27,'环控压调','环控压调',0,'2022-06-13 18:12:22','2022-06-13 18:12:22','qn','qn',4,'hkyt','环控压调',0),(28,'麦克风','语音识别设备',0,'2022-06-13 18:44:38','2022-06-13 18:44:38','qn','qn',-1,'micro','语音识别设备',0),(31,'机电综合激励设备','机电综合激励设备',0,'2022-12-26 00:00:00','2022-10-26 14:14:39','28404121','28404121',9,'jdzhjl','机电综合激励设备',0),(32,'飞参设备','飞参设备',0,'2022-12-26 00:00:01','2022-12-26 17:32:24','qn001','qn001',-1,'fc','飞参设备',0),(33,'LDU','LDU',0,'2022-12-26 00:00:00','2022-12-26 17:36:59','qn001','qn001',2,'ldu','LDU(灯驱动)',0),(34,'电压采集设备','电压采集设备',0,'2022-12-26 00:00:00','2022-12-26 17:39:51','qn001','qn001',7,'cargovol','电压采集设备',0),(35,'轮毂状态切换设备','轮毂状态切换设备',0,'2022-12-26 00:00:00','2022-12-26 17:42:19','qn001','qn001',11,'lzmn','轮毂状态切换设备',0),(37,'视频抽引','视频抽引',0,'2022-12-27 10:01:16','2022-12-27 10:01:16','qn001','qn001',-1,'spcy','视频抽引',0),(38,'供电模拟器','供电模拟器',0,'2023-02-21 15:59:39','2023-02-21 15:59:39','28404121','28404121',NULL,'',NULL,0),(40,'扭力杆圈数测量装置','扭力杆圈数测量装置',0,'2023-03-08 11:11:01','2023-03-08 11:11:01','29300624','29300624',1,'nlg','扭力杆圈数测量装置',0),(41,'倾角传感器','倾角传感器',0,'2023-03-09 17:51:27','2023-03-09 17:51:27','admin','admin',NULL,NULL,NULL,0),(42,'MBIT设备','MBIT设备',0,'2023-06-03 10:29:09','2023-06-03 10:29:09','28404121','28404121',NULL,NULL,NULL,0),(43,'左侧舵面测量','左侧舵面测量',0,'2024-03-24 09:49:18','2024-03-24 09:49:18','28404121','28404121',NULL,'aml',NULL,0),(44,'右侧舵面测量','右侧舵面测量',0,'2024-03-24 09:49:29','2024-03-24 09:49:29','28404121','28404121',NULL,'amr',NULL,0),(45,'升降舵方向舵测量','升降舵方向舵测量',0,'2024-03-24 09:49:40','2024-03-24 09:49:40','28404121','28404121',NULL,'amu',NULL,0),(46,'扰流板无线测量','扰流板无线测量',0,'2024-03-24 09:49:50','2024-03-24 09:49:50','28404121','28404121',NULL,NULL,NULL,0),(49,'舵面偏角测量','舵面偏角测量',0,NULL,NULL,NULL,NULL,1,'amall','舵面偏角测量',0),(50,'飞参计算机','飞参计算机',0,NULL,NULL,NULL,NULL,3,'flightparameter','飞参计算机',0),(51,'分布式测温','分布式测温',0,NULL,NULL,NULL,NULL,1,'InfraredTemp','分布式测温',0),(52,'液压综合管理','液压综合管理',0,NULL,NULL,NULL,NULL,3,'flightparameter1','液压综合管理',0),(53,'前轮转弯','前轮转弯',0,NULL,NULL,NULL,NULL,3,'flightparameter2','前轮转弯',0),(54,'ntp时间获取','ntp时间获取',0,NULL,NULL,NULL,NULL,NULL,NULL,NULL,0),(56,'无线电高度激励设备002','新无线电高度激励设备',0,NULL,NULL,NULL,NULL,NULL,NULL,NULL,0);
/*!40000 ALTER TABLE `device_category` ENABLE KEYS */;
UNLOCK TABLES;

--
