-- Table structure for table `subject_source`
--

DROP TABLE IF EXISTS `subject_source`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subject_source` (
  `subject_source_id` int NOT NULL AUTO_INCREMENT,
  `source_num` varchar(100) DEFAULT NULL COMMENT '技术条件编号',
  `source_version` varchar(50) NOT NULL,
  `source_desc` varchar(255) DEFAULT NULL,
  `subject_id` int NOT NULL,
  `subject_name` varchar(60) NOT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `created_by` varchar(45) DEFAULT NULL,
  `updated_by` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`subject_source_id`)
) ENGINE=InnoDB AUTO_INCREMENT=78 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subject_source`
--

LOCK TABLES `subject_source` WRITE;
/*!40000 ALTER TABLE `subject_source` DISABLE KEYS */;
INSERT INTO `subject_source` VALUES (8,'XXX-JT327-018','A','XXX-JT327-018',1,'飞控',0,'2020-11-16 09:21:45','2021-04-26 17:41:22','admin','admin'),(9,'XXX-JT327-038','A','XXX-JT327-038',1,'飞控',0,'2020-11-16 09:21:59','2021-04-26 17:41:39','admin','admin'),(10,'XXX-JT327-032','A','XXX-JT327-032',1,'飞控',0,'2020-11-16 09:22:19','2021-04-26 17:41:53','admin','admin'),(11,'XXX-JT327-042','A','XXX-JT327-042',1,'飞控',0,'2020-11-16 09:22:26','2021-04-26 17:42:02','admin','admin'),(12,'XXX-JT327-020','A','XXX-JT327-020',1,'飞控',0,'2020-11-16 09:22:37','2021-04-26 17:42:11','admin','admin'),(13,'XXX-JT327-022','A','XXX-JT327-022',1,'飞控',0,'2020-11-16 09:22:49','2021-04-26 17:42:17','admin','admin'),(14,'XXX-JT322-002','A','XXX-JT322-002',1,'飞控',0,'2020-11-16 09:23:11','2021-04-26 17:42:25','admin','admin'),(15,'**-JT424-002','A','网络供电',2,'电气',0,'2021-01-20 11:01:54','2021-04-26 17:42:32','28400647','admin'),(16,'100','A','环控',4,'环控',0,'2022-06-23 20:34:55','2022-06-23 20:34:55','qn','qn'),(17,'100','A','动力',12,'防灭火',0,'2022-06-25 16:08:49','2022-06-25 16:08:49','qn','qn'),(18,'YR-JT424-001','A','供电系统通电检查技术条件',2,'电气',0,'2022-10-22 17:16:50','2022-10-22 17:16:50','28404121','28404121'),(19,'y20-jt521-001','A','机组应急门',9,'任务',0,'2022-11-04 14:27:32','2022-11-04 14:27:32','28404121','28404121'),(20,'Y20-JT486-006','A','燃油',7,'动力',0,'2022-11-08 16:29:32','2022-11-08 16:29:32','28404121','28404121'),(44,'Y20-JT430-012  ','B','072工程风挡除雨系统功能检查技术条件  ',4,'环控',0,'2022-11-12 12:26:26','2022-11-12 12:26:26','28400647','28400647'),(45,'Y20-JT430-011  ','B','072工程风挡加温系统功能检查技术条件  ',4,'环控',0,'2022-11-12 12:26:26','2022-11-12 12:26:26','28400647','28400647'),(46,'DEO_XXX-JT424-008_A2','A2','XXX工程B状态供电系统通电检查技术条件',2,'电气',0,'2023-02-28 17:21:48','2023-02-28 17:21:48','29300613','29300613'),(47,'Y20-JT421-005','H','座舱增压控制系统技术条件',4,'环控',0,'2023-03-07 14:32:57','2023-03-07 14:32:57','qn001','qn001'),(48,'Y20-JT642-004','A','航电系统通电检查技术条件',3,'航电',0,'2023-03-08 11:40:21','2023-03-08 11:40:21','29600881','29600881'),(49,'Y20-JT660-026','C','任务管理分系统（ZZKK）通电 检查技术条件',9,'任务',0,'2023-03-08 11:54:53','2023-03-08 11:54:53','29600881','29600881'),(50,'YXX-JT332-004','A','刹车控制系统通电技术条件',11,'液起',0,'2023-03-09 15:12:04','2023-03-09 15:12:04','29300613','29300613'),(51,'Y20-JT631-006','B','072工程事故记录设备通电检查技术条件',4,'环控',0,'2023-04-14 09:17:11','2023-04-14 09:17:11','28404121','28404121'),(52,'Y20-JT642-001','C','AAAAA',3,'航电',0,'2023-04-17 16:24:31','2023-04-17 16:24:31','19704420','19704420'),(53,'Y20-JT642-003','B','AAAA',3,'航电',0,'2023-04-17 16:25:30','2023-04-17 16:25:30','19704420','19704420'),(55,'Y20-JT642-004','B','072工程B状态航电系统通电检查技术条件',3,'航电',0,'2023-04-20 09:15:15','2023-04-20 09:15:15','29600881','29600881'),(56,'Y20-JT631-007','B','072工程B状态航电系统综合备份仪表、航空 时钟通电检查技术条件',3,'航电',0,'2023-04-21 11:45:55','2023-04-21 11:45:55','29600881','29600881'),(57,'Y20-JT642-008','A','072工程B状态航姿组件、磁罗盘、无线电罗 盘（校罗差部分）通电检查技术条件',3,'航电',0,'2023-04-21 11:46:19','2023-04-21 11:46:19','29600881','29600881'),(58,'Y20-JT642-009','A','072工程（B状态）驾驶舱照明系统通电检查技术条件',3,'航电',0,'2023-04-21 11:47:51','2023-04-21 11:47:51','29600881','29600881'),(59,'Y20-JT642-011','A','072工程B状态中央告警设备通电检查技术条件',3,'航电',0,'2023-04-21 11:50:00','2023-04-21 11:50:00','29600881','29600881'),(60,'Y20-JT435-002','B','072工程B状态氧气系统安装检查技术条件',3,'航电',0,'2023-04-21 11:52:30','2023-04-21 11:52:30','29600881','29600881'),(61,'Y20-JT660-015','B','072工程担架站呼叫设备通电检查技术条件',9,'任务',0,'2023-04-23 08:16:21','2023-04-23 08:16:21','29600881','29600881'),(62,'Y20-JT660-023','A','072工程B状态侧导轨安装调整技术条件',9,'任务',0,'2023-04-23 08:18:51','2023-04-23 08:18:51','29600881','29600881'),(63,'Y20-JT660-024','A','072工程B状态电动吊车设备通电检查技术条件',9,'任务',0,'2023-04-23 08:21:37','2023-04-23 08:21:37','29600881','29600881'),(64,'Y20-JT660-027','A','运-20B飞机电动绞车通电检查技术条件',9,'任务',0,'2023-04-23 08:24:01','2023-04-23 08:24:01','29600881','29600881'),(68,'xxx-JT424-008','A','xx工程B状态供电系统通电检查技术条件',2,'电气',0,NULL,NULL,NULL,NULL),(69,'DEO_XXX-JT424-008_A1','A1','XXX工程B状态供电系统通电检查技术条件',2,'电气',0,NULL,NULL,NULL,NULL),(70,'Y20-JT332-017','A','起落架收放控制系统检查技术条件',11,'液起',0,NULL,NULL,NULL,NULL),(71,'Y20-JT327-047','A','***B状态***自动飞行控制分系统通电检查技术条件',1,'飞控',0,NULL,NULL,NULL,NULL),(72,'Y20-JT-327-046','B','***B状态***主飞行控制分系统通电检查技术条件',1,'飞控',0,NULL,NULL,NULL,NULL),(73,'Y20-PB820-021','E','***飞机2005架及后续架次软件装机状态报告',1,'飞控',0,NULL,NULL,NULL,NULL),(74,'Y**-JT327-031','B','***B状态机械备份分系统调试技术条件',1,'飞控',0,NULL,NULL,NULL,NULL),(75,'Y20-JT486-017','A','XXX工程X状态防火系统通电检查技术条件',7,'动力',0,NULL,NULL,NULL,NULL),(76,'YXX-JT332-007','B','前轮转弯系统密封性检查和工作性能检查技术条件',11,'液起',0,NULL,NULL,NULL,NULL),(77,'YXX-JT486-005','B','舱门电气控制系统通电检查',11,'液起',0,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `subject_source` ENABLE KEYS */;
UNLOCK TABLES;

--
