-- Table structure for table `test_function_group`
--

DROP TABLE IF EXISTS `test_function_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `test_function_group` (
  `fungrp_id` int unsigned NOT NULL AUTO_INCREMENT,
  `fungrp_name` varchar(60) NOT NULL,
  `subject_id` int DEFAULT NULL,
  `subject_name` varchar(60) DEFAULT NULL,
  `fungrp_desc` varchar(255) DEFAULT NULL,
  `num` int NOT NULL COMMENT '编号',
  `system_type` int NOT NULL DEFAULT '1' COMMENT '系统类型：1表示系统测,2表示线缆测',
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `created_by` varchar(45) DEFAULT NULL,
  `updated_by` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`fungrp_id`)
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `test_function_group`
--

LOCK TABLES `test_function_group` WRITE;
/*!40000 ALTER TABLE `test_function_group` DISABLE KEYS */;
INSERT INTO `test_function_group` VALUES (1,'主飞控',1,'飞控','主飞控',32700,1,0,'2021-04-26 17:38:30','2021-04-26 17:38:30','admin','admin'),(2,'自动飞控',1,'飞控','自动飞控',32200,1,0,'2021-04-26 17:39:48','2021-04-26 17:39:48','admin','admin'),(3,'高升力',1,'飞控','高升力',32100,1,0,'2021-04-26 17:40:25','2021-04-26 17:40:25','admin','admin'),(4,'供电系统',2,'电气','电气专业子系统',1,1,0,'2021-05-31 17:33:51','2021-05-31 17:33:51','28400647','28400647'),(6,'飞控线缆',1,'飞控','线缆测试示例',700,2,0,'2021-12-01 17:32:22','2021-12-01 21:10:27','qn','qn'),(7,'舱门线缆',9,'任务','线缆测试示例',100,2,0,'2021-12-01 21:05:18','2021-12-01 21:10:33','qn','qn'),(8,'任务线缆',9,'任务','线缆测试示例',200,2,0,'2021-12-01 21:05:59','2021-12-01 21:10:47','qn','qn'),(9,'动力线缆',7,'动力','线缆测试示例',300,2,0,'2021-12-01 21:06:46','2021-12-01 21:10:52','qn','qn'),(10,'防冰线缆',4,'环控','线缆测试示例',400,2,0,'2021-12-01 21:07:12','2021-12-01 21:10:55','qn','qn'),(11,'装饰线缆',4,'环控','线缆测试示例',500,2,0,'2021-12-01 21:07:36','2021-12-01 21:10:58','qn','qn'),(12,'环控线缆',4,'环控','线缆测试示例',600,2,0,'2021-12-01 21:07:59','2021-12-01 21:11:01','qn','qn'),(13,'供电线缆',2,'电气','线缆测试示例',800,2,0,'2021-12-01 21:08:36','2021-12-01 21:11:05','qn','qn'),(14,'照明线缆',2,'电气','线缆测试示例',900,2,0,'2021-12-01 21:15:46','2021-12-01 21:15:46','qn','qn'),(15,'机电管理线缆',2,'电气','线缆测试示例',1000,2,0,'2021-12-01 21:16:23','2021-12-01 21:16:23','qn','qn'),(16,'仪表线缆',3,'航电','线缆测试示例',1100,2,0,'2021-12-01 21:16:53','2021-12-01 21:16:53','qn','qn'),(17,'无线电线缆',3,'航电','线缆测试示例',1200,2,0,'2021-12-01 21:17:12','2021-12-01 21:17:12','qn','qn'),(18,'雷电线缆',3,'航电','线缆测试示例',1300,2,0,'2021-12-01 21:17:33','2021-12-01 21:17:33','qn','qn'),(19,'氧气线缆',3,'航电','线缆测试示例',1400,2,0,'2021-12-01 21:18:01','2021-12-01 21:18:01','qn','qn'),(20,'液压线缆',11,'液起','线缆测试示例',1500,2,0,'2021-12-01 21:18:19','2021-12-01 21:18:19','qn','qn'),(21,'起落架测试',11,'液起','线缆测试示例',1600,2,0,'2021-12-01 21:25:19','2021-12-01 21:25:19','qn','qn'),(22,'防冰',4,'环控','环境控制系统',100,1,0,'2022-06-23 20:34:08','2022-06-23 20:34:08','qn','qn'),(23,'舱门系统',9,'任务','舱门系统通电调试',100,1,0,'2022-11-04 14:20:10','2022-11-04 14:20:10','28404121','28404121'),(24,'环控防护系统军检',4,'环控','环境防护系统军检',100,1,0,'2022-11-07 14:31:31','2022-11-07 14:31:31','28404121','28404121'),(25,'燃油系统',7,'动力','燃油系统通电检查',100,1,0,'2022-11-08 16:28:33','2022-11-08 16:28:33','28404121','28404121'),(26,'环控系统',4,'环控','环控系统',200,1,0,'2022-11-08 17:18:46','2022-11-08 17:18:46','28404121','28404121'),(27,'无线电',3,'航电','无线电专业',642,1,0,'2023-03-08 11:08:11','2023-03-08 11:08:11','29300613','29300613'),(28,'雷达',3,'航电','雷达专业',698,1,0,'2023-03-08 11:08:34','2023-03-08 11:08:34','29300613','29300613'),(29,'显控',3,'航电','显控专业',646,1,0,'2023-03-08 11:09:04','2023-03-08 11:09:04','29300613','29300613'),(30,'仪表',3,'航电','仪表专业',623,1,0,'2023-03-08 11:11:47','2023-03-08 11:11:47','29300613','29300613'),(31,'任务管理',9,'任务','任务管理专业',660,1,0,'2023-03-08 11:12:20','2023-03-08 11:12:20','29300613','29300613'),(32,'氧气',3,'航电','氧气专业',435,1,0,'2023-03-08 11:50:57','2023-03-08 11:50:57','29600881','29600881'),(33,'液压系统',11,'液起','液压系统功能检测',100,1,0,'2023-03-09 15:10:32','2023-03-09 15:10:32','29300613','29300613'),(34,'起落架系统',11,'液起','起落架系统功能检测',200,1,0,'2023-03-09 15:11:06','2023-03-09 15:11:06','29300613','29300613'),(35,'机电系统',12,'机电','机电管理分系统测试',100,1,0,'2023-03-09 15:28:17','2023-03-09 15:28:17','29300613','29300613'),(41,'舱门系统',11,'液起','舱门系统',300,1,0,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `test_function_group` ENABLE KEYS */;
UNLOCK TABLES;

--
